%观察交界面坡度

L=[3700,2160,2300,5800,10100,10500,11000];
J0=[4.387,7.634,7.459,3.679,1.974,1.548,1.741]*0.0001;     %底坡
h0=[20.4,18.8,19.3,26.9,36.2,33.4,34.8];             %潜入前深度
h1=[16.69,15.38,15.79,22,29.61,27.32,28.47];         %潜入后深度
u1=[0.159,0.136,0.126,0.148,0.163,0.119,0.083];         %潜入后速度
interface_s=(h1-J0.*L)./L;      %交界面坡度
ndot=size(J0,2);

ksai=0.8;

plot((1:ndot),interface_s,'o');

%计算净水沉速
d=0.001*linspace(0.005,0.1,20);       %粒径，单位m
T=23;                   %温度
visc=1.775*10^(-6)/(1+0.0337*T+0.00021*T*T);
g=9.81;
rou_w=1000; 
rou_s=2650;

A1=(13.95*visc./d).^2;
A2=1.09*(rou_s-rou_w)*g*d/rou_w;
A3=13.95*visc./d;
v_set=(A1+A2).^0.5-A3;   %m/s


nline=size(d,2);
for i=1:1:nline
    hold on;
    plot((1:ndot),v_set(i)./u1);
    hold off;
end
    
    


